from aiogram.fsm.state import StatesGroup, State

# Класс для ожидания адреса
class RegistrationState(StatesGroup):
    waiting_for_address = State()
    waiting_for_api_key = State()
    waiting_for_db_id = State()

new_user_message = """
👋 Привет! Я твой бот для создания расписания с помощью голосовых сообщений и работы с Notion. Вот что я могу:\n
- 🗣 Преобразовывать твои голосовые сообщения в текст.
- 📅 Определять дату, время, название и срочность задачи.
- 📝 Добавлять задачи в Notion (календарь).
- ⏰ Напоминать о событиях.
- 📅 Показывать задачи по дням.

Чтобы начать пользоваться мной, отправь мне свой <b>API ключ</b> и <b>ID базы данных</b> из Notion. 🔑
\nИнструкцию по получению этих данных ты найдёшь ниже. Пожалуйста, отправь мне API ключ и ID базы данных, и я помогу создать твоё первое событие в Notion! 📅✨
"""

existing_user_message = """
👋 Привет! Я твой помощник по созданию расписания в Notion. Напоминаю, что я могу:\n
- 🗣 Обрабатывать твои голосовые сообщения и превращать их в задачи.
- 📅 Сохранять события в Notion и напоминать о них.
- 📅 Показывать все твои задачи по дням.

Чтобы взаимодействовать со мной, просто нажми на одну из кнопок ниже, и я помогу тебе с задачами! 🔥
"""


audio_processing_message = "Ваше голосовое сообщение в процессе обработки 🎧\nЭто может занять некоторое время ⏳"

link_message = "📝 Пожалуйста, отправьте ваш API согласно инструкции"

instruction_id = 'BQACAgIAAxkBAAIHimfEqbukTGT10V1XiBsESVlJqUlHAAKXZwACEaUpSoqdXfWh8b2yNgQ'



