from aiogram.fsm.state import StatesGroup, State

# Класс для ожидания адреса
class RegistrationState(StatesGroup):
    waiting_for_address = State()
    waiting_for_api_key = State()
    waiting_for_db_id = State()

new_user_message = """
👋 Привет! Я твой бот для создания расписания с помощью голосовых сообщений. Вот что я могу:\n
- 🗣 Преобразовывать твои голосовые сообщения в текст.
- 📅 Определять дату, время, название и срочность задачи.
- 📝 Добавлять задачи в Google Calendar.
- ⏰ Напоминать о событиях.
- 📅 Показывать задачи по дням.

Чтобы начать пользоваться мной, отправь мне свой адрес в формате iCal от Google Calendar. 🔑
\nИнструкцию по получению ключа ты найдёшь ниже. Пожалуйста, отправь мне адрес, и я помогу создать твоё первое событие! 📅✨
"""

existing_user_message = """
👋 Привет! Я твой помощник по созданию расписания. Напоминаю, что я могу:\n
- 🗣 Обрабатывать твои голосовые сообщения и превращать их в задачи.
- 📅 Сохранять события в Google Calendar и напоминать о них.
- 📅 Показывать все твои задачи по дням.

Чтобы взаимодействовать со мной, просто нажми на одну из кнопок ниже, и я помогу тебе с задачами! 🔥
"""

audio_processing_message = "Ваше голосовое сообщение в процессе обработки 🎧\nЭто может занять некоторое время ⏳"

link_message = "Пожалуйста, отправьте ваш адрес согласно инструкции 😊"

instruction_id = 'BQACAgIAAxkBAANCZ74aS7bgUC7M4syk5__fgPSrgNgAAltqAAJAtfFJqJ-PFBTbfzU2BA'



