from aiogram.fsm.state import StatesGroup, State

class NotificationState(StatesGroup):
    waiting_for_time = State() 

notification_text = """
🔔 <u><b>Настройка уведомлений</b></u>

Привет! 😊 Я помогу тебе настроить уведомления о событиях. Просто напиши, за какой период времени до события ты хочешь получить напоминание:

<b>⏰ Примеры:</b>
- 1 час
- 30 минут
- 1 минута
- 4 часа

Напиши время, и я всё настрою! ✨
"""

invalid_time_format_message = '''⚠️ Неверный формат. Пожалуйста, укажи время в формате:
- X минут
- Y часов Z минут
Например: '2 часа 15 минут', '30 минут', '5 часов'.'''
