class VoiceRecordingStates:
    WAITING_FOR_VOICE = 'waiting_for_voice'


voice_instruction_message = """📢 <b>Как правильно записывать голосовое сообщение для добавления событий?</b> 🎙️  

Чтобы я мог правильно понять и записать ваши события, придерживайтесь <b>чёткой структуры</b>:  

✅ <b>Что делать?</b> – Название события (<i>обязательно</i>)  
✅ <b>Когда?</b> – Дата в формате <b>"день месяц год"</b> или просто <b>"сегодня / завтра"</b>  
✅ <b>Во сколько?</b> – Время начала (<i>если есть</i>)  
✅ <b>До скольки?</b> – Время окончания (<i>если есть</i>)  
✅ <b>Дополнительные детали</b> – Например, место встречи или что нужно взять с собой (<i>по желанию</i>)  

---  

❌ <b>Плохо:</b>  
🚫 "Собрание" (<i>непонятно когда</i>)  
🚫 "15 марта в 12:00" (<i>непонятно что делать</i>)  
🚫 "В 10 утра встреча" (<i>не хватает даты</i>)  

✅ <b>Хорошо:</b>  
✔️ "15 марта в 12:00 встреча с клиентом в офисе"  
✔️ "Завтра с 10:00 до 11:30 поход в спортзал"  
✔️ "Сегодня в 19:00 ужин с друзьями в ресторане"  

💡 <b>Если в вашем голосовом сообщении не хватает даты или названия события, я не смогу его записать!</b>  

🎤 Попробуйте сказать чётко, как в примерах выше, и ваше расписание будет всегда под контролем! 😉""" 


cancel_event_message = "🔄 <b>Добавление мероприятия отменено!</b>\n🎙️ Отправьте голосовое сообщение ещё раз или просто отмените действие 😉"

event_added_message = "✅ <b>Мероприятие успешно добавлено!</b>\n🎉 Всё готово, можете расслабиться! 😉"
